In [4]:
# Pandas 패키지
import pandas as pd

In [5]:
# Series 모듈 사용
s1 = pd.Series([10, 20, 30, 40, 50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [6]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
# Series 값만 추출
s1.values

array([10, 20, 30, 40, 50], dtype=int64)

In [8]:
# 문자와 숫자 혼합 -> 문자로 인식
s2 = pd.Series(['a', 'b', 'c', 1, 2, 3])
s2

0    a
1    b
2    c
3    1
4    2
5    3
dtype: object

In [9]:
# 결측치가 존재할 때
import numpy as np

In [10]:
s3 = pd.Series([np.nan, 10, 30])
s3

0     NaN
1    10.0
2    30.0
dtype: float64

In [11]:
index_date = ['2020-10-07', '2020-10-08', '2020-10-09', '2020-10-10']

In [12]:
s4 = pd.Series([200, 195, np.nan, 205], index = index_date)
s4

2020-10-07    200.0
2020-10-08    195.0
2020-10-09      NaN
2020-10-10    205.0
dtype: float64

In [13]:
# 딕셔너리 형태로 표현
s5 = pd.Series({'국어':100, '영어': 87, '수학': 66})
s5

국어    100
영어     87
수학     66
dtype: int64

In [14]:
# 연속된 날짜 모듈 사용
import pandas as pd
pd.date_range(start = '2020-10-10', end = '2020-10-15')

DatetimeIndex(['2020-10-10', '2020-10-11', '2020-10-12', '2020-10-13',
               '2020-10-14', '2020-10-15'],
              dtype='datetime64[ns]', freq='D')

In [15]:
pd.date_range(start = '10-10-2020', end = '10/15/2020')

DatetimeIndex(['2020-10-10', '2020-10-11', '2020-10-12', '2020-10-13',
               '2020-10-14', '2020-10-15'],
              dtype='datetime64[ns]', freq='D')

In [16]:
pd.date_range(start = '2020-10-10', periods = 7)

DatetimeIndex(['2020-10-10', '2020-10-11', '2020-10-12', '2020-10-13',
               '2020-10-14', '2020-10-15', '2020-10-16'],
              dtype='datetime64[ns]', freq='D')

In [17]:
pd.date_range(start = '2020-10-10', periods = 4, freq ='2D') # 이틀간격 출력

DatetimeIndex(['2020-10-10', '2020-10-12', '2020-10-14', '2020-10-16'], dtype='datetime64[ns]', freq='2D')

In [18]:
pd.date_range(start = '2020-10-10', periods = 4, freq ='w') # 월요일마다 출력

DatetimeIndex(['2020-10-11', '2020-10-18', '2020-10-25', '2020-11-01'], dtype='datetime64[ns]', freq='W-SUN')

In [19]:
pd.date_range(start = '2020-1-1', periods = 12, freq ='2BM')

DatetimeIndex(['2020-01-31', '2020-03-31', '2020-05-29', '2020-07-31',
               '2020-09-30', '2020-11-30', '2021-01-29', '2021-03-31',
               '2021-05-31', '2021-07-30', '2021-09-30', '2021-11-30'],
              dtype='datetime64[ns]', freq='2BM')

In [20]:
pd.date_range(start = '2020-1-1', periods = 4, freq ='QS') # 분기별 출력

DatetimeIndex(['2020-01-01', '2020-04-01', '2020-07-01', '2020-10-01'], dtype='datetime64[ns]', freq='QS-JAN')

In [21]:
index_date = pd.date_range(start = '2020-03-01', periods = 5, freq = 'D')
pd.Series([50, 60, 55, 57, 59], index = index_date)

2020-03-01    50
2020-03-02    60
2020-03-03    55
2020-03-04    57
2020-03-05    59
Freq: D, dtype: int64

In [22]:
# 데이터프레임 생성
import pandas as pd
pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [23]:
import numpy as np
import pandas as pd
data_list = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])

In [24]:
pd.DataFrame(data_list)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [25]:
# 데이터프레임 구조 변경
index_data = pd.date_range('2021-03-01', periods = 3)

In [26]:
index_data

DatetimeIndex(['2021-03-01', '2021-03-02', '2021-03-03'], dtype='datetime64[ns]', freq='D')

In [27]:
columns_list = ['A', 'B', 'c']

In [28]:
pd.DataFrame(data_list, index = index_data, columns = columns_list)

            A  B  c
2021-03-01  1  2  3
2021-03-02  4  5  6
2021-03-03  7  8  9

In [29]:
table_data = {'연도': [2020, 2021, 2021, 2022, 2022],
              '지사': ['한국', '미국', '한국', '미국', '한국'], 
              '고객 수': [250, 450, 300, 500, 200]}
table_data

{'연도': [2020, 2021, 2021, 2022, 2022],
 '지사': ['한국', '미국', '한국', '미국', '한국'],
 '고객 수': [250, 450, 300, 500, 200]}

In [30]:
df= pd.DataFrame(table_data)
df

     연도  지사  고객 수
0  2020  한국   250
1  2021  미국   450
2  2021  한국   300
3  2022  미국   500
4  2022  한국   200

In [31]:
# 인덱스 추출
df.index

RangeIndex(start=0, stop=5, step=1)

In [32]:
# 컬럼 추출
df.columns

Index(['연도', '지사', '고객 수'], dtype='object')

In [33]:
# 값 추출
df.values

array([[2020, '한국', 250],
       [2021, '미국', 450],
       [2021, '한국', 300],
       [2022, '미국', 500],
       [2022, '한국', 200]], dtype=object)

In [34]:
# Series 데이터 연산
d1 = pd.Series([1, 2, 3, 4, 5])
d2 = pd.Series([10, 20, 30, 40, 50])

In [35]:
d1 + d2

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [36]:
d2 - d1

0     9
1    18
2    27
3    36
4    45
dtype: int64

In [37]:
d1 * d2

0     10
1     40
2     90
3    160
4    250
dtype: int64

In [38]:
d2 / d1

0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
dtype: float64

In [39]:
d3 = pd.Series([1, 2, 3])
d4 = pd.Series([10, 20, 30, 40, 50])

In [40]:
d3 + d4

0    11.0
1    22.0
2    33.0
3     NaN
4     NaN
dtype: float64

In [41]:
d3 * d4

0    10.0
1    40.0
2    90.0
3     NaN
4     NaN
dtype: float64

In [42]:
# 데이터프레임 연산
table_d1 = {'A':[1, 2, 3, 4, 5],
            'B': [10, 20, 30, 40, 50],
            'C': [100, 200, 300, 400, 500]}
df1 = pd.DataFrame(table_d1)
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [43]:
table_d2 = {'A':[6, 7, 8],
            'B': [60, 70, 80],
            'C': [600, 700, 800]}
df2 = pd.DataFrame(table_d2)
df2

   A   B    C
0  6  60  600
1  7  70  700
2  8  80  800

In [44]:
df1 + df2

      A      B       C
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN

In [45]:
table_d3 = {'봄': [266.5, 275.3, 265.9, 222.2, 308.8],
           '여름': [763.7, 528.6, 574.6, 352.4, 477.5], 
           '가을': [365.4, 274.7, 296.6, 287.8, 356.7], 
           '겨울': [187.3, 69.8, 85.9, 89.1, 104.5]}
columns_list = ['봄', '여름', '가을', '겨울']
index_list = ['2022', '2023', '2024', '2025', '2026']

In [46]:
df3 = pd.DataFrame(table_d3, index = index_list, columns = columns_list)
df3

          봄     여름     가을     겨울
2022  266.5  763.7  365.4  187.3
2023  275.3  528.6  274.7   69.8
2024  265.9  574.6  296.6   85.9
2025  222.2  352.4  287.8   89.1
2026  308.8  477.5  356.7  104.5

In [47]:
# 컬럼 평균
df3.mean()

봄     267.74
여름    539.36
가을    316.24
겨울    107.32
dtype: float64

In [48]:
df3. std()

봄      30.910726
여름    150.388474
가을     41.754796
겨울     46.376955
dtype: float64

In [49]:
# 인덱스 평균
df3.mean(axis = 1)

2022    395.725
2023    287.100
2024    305.750
2025    237.875
2026    311.875
dtype: float64

In [50]:
df3.std(axis = 1)

2022    255.907071
2023    187.824865
2024    201.896087
2025    112.528793
2026    155.407816
dtype: float64

In [62]:
# 데이터 선택하기
import numpy as np
import pandas as pd

In [63]:
KBO = {'넥센':[0.571, 0.619, 0.545, 0.538, 0.546, 0.153],
      '두산':[0.568, 0.465, 0.549, 0.650, 0.286, 0.891],
      '롯데':[0.532, 0.457, 0.462, 0.458, 0.578, 0.462],
      '삼성':[0.595, 0.624, 0.611, 0.455, 0.542, 0.568],
      '한화':[0.331, 0.389, 0.472, 0.468, 0.548, 0.963],
      '기아':[0.408, 0.22, 0.65, 0.490, 0.608, 0.486],
      'KT':[np.NaN, np.NaN, 0.364, 0.373, 0.347, 0.741],
      'LG':[0.579, 0.492, 0.451, 0.500, 0.156, 0.596],
      'NC':[0.419, 0.551, 0.596, 0.589, 0.962, 0.634],
      'SK':[0.496, 0.484, 0.486, 0.479, 0.183, 0.368]}

In [64]:
col_list = ['넥센', '두산', '롯데', '삼성', '한화', '기아', 'KT', 'LG', 'NC', 'SK']
idx_list = ['2013', '2014', '2015', '2016', '2017', '2018']

In [65]:
df_KBO = pd.DataFrame(KBO, columns = col_list, index = idx_list)
df_KBO

         넥센     두산     롯데     삼성     한화     기아     KT     LG     NC     SK
2013  0.571  0.568  0.532  0.595  0.331  0.408    NaN  0.579  0.419  0.496
2014  0.619  0.465  0.457  0.624  0.389  0.220    NaN  0.492  0.551  0.484
2015  0.545  0.549  0.462  0.611  0.472  0.650  0.364  0.451  0.596  0.486
2016  0.538  0.650  0.458  0.455  0.468  0.490  0.373  0.500  0.589  0.479
2017  0.546  0.286  0.578  0.542  0.548  0.608  0.347  0.156  0.962  0.183
2018  0.153  0.891  0.462  0.568  0.963  0.486  0.741  0.596  0.634  0.368

In [66]:
df_KBO.columns

Index(['넥센', '두산', '롯데', '삼성', '한화', '기아', 'KT', 'LG', 'NC', 'SK'], dtype='object')

In [67]:
df_KBO.index

Index(['2013', '2014', '2015', '2016', '2017', '2018'], dtype='object')

In [68]:
df_KBO.values

array([[0.571, 0.568, 0.532, 0.595, 0.331, 0.408,   nan, 0.579, 0.419,
        0.496],
       [0.619, 0.465, 0.457, 0.624, 0.389, 0.22 ,   nan, 0.492, 0.551,
        0.484],
       [0.545, 0.549, 0.462, 0.611, 0.472, 0.65 , 0.364, 0.451, 0.596,
        0.486],
       [0.538, 0.65 , 0.458, 0.455, 0.468, 0.49 , 0.373, 0.5  , 0.589,
        0.479],
       [0.546, 0.286, 0.578, 0.542, 0.548, 0.608, 0.347, 0.156, 0.962,
        0.183],
       [0.153, 0.891, 0.462, 0.568, 0.963, 0.486, 0.741, 0.596, 0.634,
        0.368]])

In [70]:
# 상위 5개 레코드 값
df_KBO.head()

         넥센     두산     롯데     삼성     한화     기아     KT     LG     NC     SK
2013  0.571  0.568  0.532  0.595  0.331  0.408    NaN  0.579  0.419  0.496
2014  0.619  0.465  0.457  0.624  0.389  0.220    NaN  0.492  0.551  0.484
2015  0.545  0.549  0.462  0.611  0.472  0.650  0.364  0.451  0.596  0.486
2016  0.538  0.650  0.458  0.455  0.468  0.490  0.373  0.500  0.589  0.479
2017  0.546  0.286  0.578  0.542  0.548  0.608  0.347  0.156  0.962  0.183

In [71]:
# 하위 5개 레코드 값
df_KBO.tail()

         넥센     두산     롯데     삼성     한화     기아     KT     LG     NC     SK
2014  0.619  0.465  0.457  0.624  0.389  0.220    NaN  0.492  0.551  0.484
2015  0.545  0.549  0.462  0.611  0.472  0.650  0.364  0.451  0.596  0.486
2016  0.538  0.650  0.458  0.455  0.468  0.490  0.373  0.500  0.589  0.479
2017  0.546  0.286  0.578  0.542  0.548  0.608  0.347  0.156  0.962  0.183
2018  0.153  0.891  0.462  0.568  0.963  0.486  0.741  0.596  0.634  0.368

In [76]:
df_KBO[1:2]

         넥센     두산     롯데     삼성     한화    기아  KT     LG     NC     SK
2014  0.619  0.465  0.457  0.624  0.389  0.22 NaN  0.492  0.551  0.484

In [77]:
df_KBO[2:6]

         넥센     두산     롯데     삼성     한화     기아     KT     LG     NC     SK
2015  0.545  0.549  0.462  0.611  0.472  0.650  0.364  0.451  0.596  0.486
2016  0.538  0.650  0.458  0.455  0.468  0.490  0.373  0.500  0.589  0.479
2017  0.546  0.286  0.578  0.542  0.548  0.608  0.347  0.156  0.962  0.183
2018  0.153  0.891  0.462  0.568  0.963  0.486  0.741  0.596  0.634  0.368

In [78]:
# 특정 index값 지정하여 추출
df_KBO.loc['2018']

넥센    0.153
두산    0.891
롯데    0.462
삼성    0.568
한화    0.963
기아    0.486
KT    0.741
LG    0.596
NC    0.634
SK    0.368
Name: 2018, dtype: float64

In [80]:
df_KBO['2015':'2017']

         넥센     두산     롯데     삼성     한화     기아     KT     LG     NC     SK
2015  0.545  0.549  0.462  0.611  0.472  0.650  0.364  0.451  0.596  0.486
2016  0.538  0.650  0.458  0.455  0.468  0.490  0.373  0.500  0.589  0.479
2017  0.546  0.286  0.578  0.542  0.548  0.608  0.347  0.156  0.962  0.183

In [82]:
# 특정 column값 지정하여 추출
df_KBO['삼성']

2013    0.595
2014    0.624
2015    0.611
2016    0.455
2017    0.542
2018    0.568
Name: 삼성, dtype: float64

In [84]:
df_KBO['삼성']['2014':'2018']

2014    0.624
2015    0.611
2016    0.455
2017    0.542
2018    0.568
Name: 삼성, dtype: float64

In [87]:
df_KBO[['삼성', '롯데', '두산', '넥센']]

         삼성     롯데     두산     넥센
2013  0.595  0.532  0.568  0.571
2014  0.624  0.457  0.465  0.619
2015  0.611  0.462  0.549  0.545
2016  0.455  0.458  0.650  0.538
2017  0.542  0.578  0.286  0.546
2018  0.568  0.462  0.891  0.153

In [88]:
df_KBO.loc[['2014', '2018']]

         넥센     두산     롯데     삼성     한화     기아     KT     LG     NC     SK
2014  0.619  0.465  0.457  0.624  0.389  0.220    NaN  0.492  0.551  0.484
2018  0.153  0.891  0.462  0.568  0.963  0.486  0.741  0.596  0.634  0.368

In [89]:
# 데이터 통합하기
# 세로 방향으로 결합
import pandas as pd
import numpy as np

In [94]:
df1 = pd.DataFrame({'class1':[45, 46, 48, 50],
                   'class2':[41, 42, 44, 48]})

df1

   class1  class2
0      45      41
1      46      42
2      48      44
3      50      48

In [92]:
df2 = pd.DataFrame({'class3':[41, 42],
                   'class4':[45, 48]})

df2

   class3  class4
0      41      45
1      42      48

In [96]:
df1.append(df2, ignore_index=True)

   class1  class2  class3  class4
0    45.0    41.0     NaN     NaN
1    46.0    42.0     NaN     NaN
2    48.0    44.0     NaN     NaN
3    50.0    48.0     NaN     NaN
4     NaN     NaN    41.0    45.0
5     NaN     NaN    42.0    48.0

In [97]:
df1.append(df2)

   class1  class2  class3  class4
0    45.0    41.0     NaN     NaN
1    46.0    42.0     NaN     NaN
2    48.0    44.0     NaN     NaN
3    50.0    48.0     NaN     NaN
0     NaN     NaN    41.0    45.0
1     NaN     NaN    42.0    48.0

In [98]:
# 가로 방향으로 결합
df3 = pd.DataFrame({'class3':[49, 47, 43, 42]})
df3

   class3
0      49
1      47
2      43
3      42

In [100]:
df1.join(df3)

   class1  class2  class3
0      45      41      49
1      46      42      47
2      48      44      43
3      50      48      42

In [103]:
index_label = ['a', 'b', 'c', 'd']
df1a = pd.DataFrame({'class1':[48, 46, 49, 50],
                    'class2':[44, 46, 42, 41]}, index = index_label)
df4a = pd.DataFrame({'class3':[43, 42, 42, 47]}, index = index_label)

In [104]:
df1a

   class1  class2
a      48      44
b      46      46
c      49      42
d      50      41

In [105]:
df4a

   class3
a      43
b      42
c      42
d      47

In [106]:
df1a.join(df4a)

   class1  class2  class3
a      48      44      43
b      46      46      42
c      49      42      42
d      50      41      47

In [107]:
df5 = pd.DataFrame({'class5':[42, 47]})

In [108]:
df1.join(df5)

   class1  class2  class5
0      45      41    42.0
1      46      42    47.0
2      48      44     NaN
3      50      48     NaN

In [116]:
# 특정한 기준을 통해 통합
df_6 = pd.DataFrame({'판매월':['9월', '10월', '11월', '12월'],
                     '제품A':[120, 167, 214, 209],
                    '제품B':[190, 210, 348, 365]})

df_7 = pd.DataFrame({'판매월':['9월', '10월', '11월', '12월'],
                     '제품C':[123, 267, 344, 199],
                    '제품D':[450, 120, 334, 410]})

In [117]:
df_6

   판매월  제품A  제품B
0   9월  120  190
1  10월  167  210
2  11월  214  348
3  12월  209  365

In [118]:
df_7

   판매월  제품C  제품D
0   9월  123  450
1  10월  267  120
2  11월  344  334
3  12월  199  410

In [119]:
df_6.merge(df_7)

   판매월  제품A  제품B  제품C  제품D
0   9월  120  190  123  450
1  10월  167  210  267  120
2  11월  214  348  344  334
3  12월  209  365  199  410

In [120]:
df_7.merge(df_6)

   판매월  제품C  제품D  제품A  제품B
0   9월  123  450  120  190
1  10월  267  120  167  210
2  11월  344  334  214  348
3  12월  199  410  209  365

In [123]:
df_left = pd.DataFrame({'key':['A','B','C'], 'left':[1, 2, 3]})
df_left

  key  left
0   A     1
1   B     2
2   C     3

In [124]:
df_right = pd.DataFrame({'key':['A','B','D'], 'right':[4, 5, 6]})
df_right

  key  right
0   A      4
1   B      5
2   D      6

In [126]:
# 공통인 key컬럼 값으로 통합
df_left.merge(df_right, how = 'left', on = 'key')

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   C     3    NaN

In [127]:
df_left.merge(df_right, how = 'right', on = 'key')

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

In [128]:
df_left.merge(df_right, how = 'outer', on = 'key')

  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   C   3.0    NaN
3   D   NaN    6.0

In [129]:
df_left.merge(df_right, how = 'inner', on = 'key')

  key  left  right
0   A     1      4
1   B     2      5

In [20]:
# 외부 데이터 불러오기
import pandas as pd

In [23]:
pd.read_csv('C:\\Users\\bigdata\\workspace\\Python\\data\\kbo.csv', encoding='cp949')

     연도     넥센     두산     롯데     삼성     한화    KIA     LG     NC     SK
0  2013  0.571  0.264  0.571  0.264  0.571  0.264  0.571  0.264  0.571
1  2014  0.610  0.123  0.610  0.123  0.610  0.123  0.610  0.123  0.610
2  2015  0.245  0.456  0.245  0.456  0.245  0.456  0.245  0.456  0.245
3  2016  0.686  0.789  0.686  0.789  0.686  0.789  0.686  0.789  0.686
4  2017  0.513  0.987  0.513  0.987  0.513  0.987  0.513  0.987  0.513
5  2018  0.661  0.596  0.661  0.596  0.661  0.596  0.661  0.596  0.661

In [25]:
# 탭으로 구분된 파일
pd.read_csv('C:\\Users\\bigdata\\workspace\\Python\\data\\kbo.txt', sep = '\t')

     연도     넥센     두산     롯데     삼성     한화    KIA     LG     NC     SK
0  2013  0.571  0.264  0.571  0.264  0.571  0.264  0.571  0.264  0.571
1  2014  0.610  0.123  0.610  0.123  0.610  0.123  0.610  0.123  0.610
2  2015  0.245  0.456  0.245  0.456  0.245  0.456  0.245  0.456  0.245
3  2016  0.686  0.789  0.686  0.789  0.686  0.789  0.686  0.789  0.686
4  2017  0.513  0.987  0.513  0.987  0.513  0.987  0.513  0.987  0.513
5  2018  0.661  0.596  0.661  0.596  0.661  0.596  0.661  0.596  0.661

In [31]:
# 파일 생성 및 저장
df_body = pd.DataFrame({'Weight':[72, 77, 65, 79],
                       'Heght':[175, 182, 160, 168]},
                       index = ['Yoon', 'Jeong', "Kim", 'Hwang'])
df_body

       Weight  Heght
Yoon       72    175
Jeong      77    182
Kim        65    160
Hwang      79    168

In [32]:
df_body.index.name = 'User'

In [33]:
df_body

       Weight  Heght
User
Yoon       72    175
Jeong      77    182
Kim        65    160
Hwang      79    168

In [34]:
bmi = df_body['Weight']/(df_body['Heght']/100)**2
bmi

User
Yoon     23.510204
Jeong    23.245985
Kim      25.390625
Hwang    27.990363
dtype: float64

In [36]:
# 새로운 변수에 데이터 값 지정
df_body['BMI'] = bmi
df_body

       Weight  Heght        BMI
User
Yoon       72    175  23.510204
Jeong      77    182  23.245985
Kim        65    160  25.390625
Hwang      79    168  27.990363

In [39]:
df_body.to_csv('C:\\Users\\bigdata\\workspace\\Python\\data\\body.csv')

In [40]:
file_name = 'C:\\Users\\bigdata\\workspace\\Python\\data\\body_cp949.txt'
df_body.to_csv(file_name, sep = " ", encoding = 'cp949')